; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	infrared2 - mode
	image3 - mode
	spectrograph0 - mode
	image1 - mode
	Star1 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	GroundStation5 - direction
	GroundStation11 - direction
	Star9 - direction
	GroundStation10 - direction
	Star7 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image1)
	(supports instrument1 image3)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation11)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 image1)
	(supports instrument3 infrared2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 GroundStation10)
	(supports instrument4 image3)
	(supports instrument4 infrared2)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument5 image3)
	(supports instrument5 infrared2)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation10)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet13)
)
(:goal (and
	(pointing satellite0 Star7)
	(pointing satellite1 GroundStation4)
	(pointing satellite2 GroundStation3)
	(have_image Star12 image3)
	(have_image Planet13 spectrograph0)
	(have_image Phenomenon14 image3)
))

)

; plan
1. (turn_to satellite2 groundstation3 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 groundstation3)
   goals met: 1 of 6
2. (turn_to satellite1 groundstation4 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 groundstation4)
   goals met: 2 of 6
3. (turn_to satellite0 groundstation11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation11)
   goals met: 2 of 6
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 6
5. (calibrate satellite0 instrument1 groundstation11)
   added: (calibrated instrument1)
   goals met: 2 of 6
6. (turn_to satellite0 phenomenon14 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 6
7. (take_image satellite0 phenomenon14 instrument1 image3)
   added: (have_image phenomenon14 image3)
   goals met: 3 of 6
8. (turn_to satellite0 planet13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet13)
   goals met: 3 of 6
9. (take_image satellite0 planet13 instrument1 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 4 of 6
10. (turn_to satellite0 star12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star12)
   goals met: 4 of 6
11. (take_image satellite0 star12 instrument1 image3)
   added: (have_image star12 image3)
   goals met: 5 of 6
12. (turn_to satellite0 star7 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star7)
   goals met: 6 of 6
